- 쉘 백그라운드 실행
일반적으로 SSH 접속이 중단되면 그 세션에서 Foreground로 실행중인 스크립트도 중단된다.
중단되지 않게 하려면 백그라운드로 실행하면 된다.
> nohub : 행업 시그널(종료 신호)이 와도 무시하며 실행을 계속함. 터미널이 끊겨도 계속 수행
> background & : 새로운 프로세스를 생성하여 작업 실행. 새로운 작업을 현재 세션에서 가능하게 함. 터미널이 끊기면 실행이 끝남

- nice & renice
 nice
 > 프로세스가 실행될 때 실행 우선 순위를 조정(NI값 변경)
 > 커다란 프로그램을 컴파일할 때 처럼 CPU나 메모리를 많이 사용할 떄 시스템 속도를 저하시키기 때문에 다른 프로세스에 우선순위를 줄 때 사용
 > 기본 nice값은 보통 0으로 시작
 > -20 ~ 19까지 순위 값을 조정 가능. -20이 우선순위가 가장 높고 19가 가장 낮음
 > 일반 유저는 값을 올릴수만 있음
 
 renice
 > 실행중인 프로세스에 대한 nice값을 조정
 > nice는 프로세스명으로 우선 순위를 조정하고 명령을 실행하면 새로운 프로세스가 발생하지만, renice는 PID로 우선 순위를 조정하고 기존의 프로세스 우선순위 값을 추가 없이 바로 수정한다
 > 기존의 NI값과 상관없이 지정한 NI로 바로 설정됨(nice와 차이)
 > root만이 값을 감소할 수 있음
