- 쉘 백그라운드 실행
일반적으로 SSH 접속이 중단되면 그 세션에서 Foreground로 실행중인 스크립트도 중단된다.
중단되지 않게 하려면 백그라운드로 실행하면 된다.
> nohub : 행업 시그널(종료 신호)이 와도 무시하며 실행을 계속함. 터미널이 끊겨도 계속 수행
> background & : 새로운 프로세스를 생성하여 작업 실행. 새로운 작업을 현재 세션에서 가능하게 함. 터미널이 끊기면 실행이 끝남

- nice & renice
 nice
 > 프로세스가 실행될 때 실행 우선 순위를 조정(NI값 변경)
 > 커다란 프로그램을 컴파일할 때 처럼 CPU나 메모리를 많이 사용할 떄 시스템 속도를 저하시키기 때문에 다른 프로세스에 우선순위를 줄 때 사용
 > 기본 nice값은 보통 0으로 시작
 > -20 ~ 19까지 순위 값을 조정 가능. -20이 우선순위가 가장 높고 19가 가장 낮음
 > 일반 유저는 값을 올릴수만 있음
 
 renice
 > 실행중인 프로세스에 대한 nice값을 조정
 > nice는 프로세스명으로 우선 순위를 조정하고 명령을 실행하면 새로운 프로세스가 발생하지만, renice는 PID로 우선 순위를 조정하고 기존의 프로세스 우선순위 값을 추가 없이 바로 수정한다
 > 기존의 NI값과 상관없이 지정한 NI로 바로 설정됨(nice와 차이)
 > root만이 값을 감소할 수 있음
 
- 고아프로세스 & 좀비프로세스
 고아프로세스
 > 부모 프로세스가 자식 프로세스보다 먼저 종료되면 init 프로세스가 자식 프로세스의 새로운 부모 프로세스가 됨
 > 종료되는 프로세스가 발생할 때 커널은 이 프로세스가 누구의 부모 프로세스인지 확인한 후, 커널이 자식 프로세스의 부모 프로세스 ID를 1(init 프로세스)로 바꿈
 > init 프로세스는 유닉스 계열의 운영체제에서 부팅 과정 중 생성되는 최초의 프로세스이며 시스템이 종료될때까지 계속 살아있는 데몬 프로세스 (init 프로세스의 pid는 보통 1)
 > 고아 프로세스가 작업을 종료하면 init 프로세스가 wait함수를 호출하여 고아 프로세스의 종료 상태를 회수함으로써 좀비 프로세스가 되는것을 방지
 
 좀비프로세스
 > 부모 프로세스가 자식 프로세스의 종료 상태를 회수하지 못했을 경우에 자식 프로세스를 좀비 프로세스라고 함
 > 좀비 프로세스의 경우 부모 프로세스에서 wait 시스템콜을 사용해줘야 리소스 유출을 방지할 수 있음
 
- Windows user 권한
 > 원격데스크탑 접속을 위해서는 해당 계정이 Remote Desktop Users 그룹이나 Administrator 그룹에 포함되어야 함
 > 계정에 여러 권한이(허용and거부) 중첩되어 있을 경우, 거부 권한이 허용 권한보다 우선됨
 > Administrator 그룹에 있더라도 "관리자 권한으로 실행"을 통해 상승시켜야 하는 작업이 있음
 > Windows는 각 계정마다 할당된 SID로 구분되며 유저 삭제 후, 동일한 이름의 계정을 만들더라도 다른 SID가 부여되어 이전과 같은 권한을 사용할 수 없음
 
